{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "3f465500",
   "metadata": {},
   "source": [
    "# Project 3 Notebook"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3405ff0b",
   "metadata": {},
   "source": [
    "# BART Map"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ed89bd9e",
   "metadata": {},
   "source": [
    "![Bart Map](bart_map.png)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "33c6e20e",
   "metadata": {},
   "source": [
    "# Included Modules and Packages"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 286,
   "id": "530d745a",
   "metadata": {},
   "outputs": [],
   "source": [
    "import csv\n",
    "\n",
    "import math\n",
    "import numpy as np\n",
    "import pandas as pd\n",
    "\n",
    "import psycopg2\n",
    "\n",
    "import json\n",
    "\n",
    "import gmaps\n",
    "import gmaps.geojson_geometries\n",
    "\n",
    "from geographiclib.geodesic import Geodesic"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c91c8869",
   "metadata": {},
   "source": [
    "# Supporting code"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 287,
   "id": "8e09ebb0",
   "metadata": {},
   "outputs": [],
   "source": [
    "#\n",
    "# function to run a select query and return rows in a pandas dataframe\n",
    "# pandas puts all numeric values from postgres to float\n",
    "# if it will fit in an integer, change it to integer\n",
    "#\n",
    "\n",
    "def my_select_query_pandas(query, rollback_before_flag, rollback_after_flag):\n",
    "    \"function to run a select query and return rows in a pandas dataframe\"\n",
    "    \n",
    "    if rollback_before_flag:\n",
    "        connection.rollback()\n",
    "    \n",
    "    df = pd.read_sql_query(query, connection)\n",
    "    \n",
    "    if rollback_after_flag:\n",
    "        connection.rollback()\n",
    "    \n",
    "    # fix the float columns that really should be integers\n",
    "    \n",
    "    for column in df:\n",
    "    \n",
    "        if df[column].dtype == \"float64\":\n",
    "\n",
    "            fraction_flag = False\n",
    "\n",
    "            for value in df[column].values:\n",
    "                \n",
    "                if not np.isnan(value):\n",
    "                    if value - math.floor(value) != 0:\n",
    "                        fraction_flag = True\n",
    "\n",
    "            if not fraction_flag:\n",
    "                df[column] = df[column].astype('Int64')\n",
    "    \n",
    "    return(df)\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 288,
   "id": "1f198d4d",
   "metadata": {},
   "outputs": [],
   "source": [
    "connection = psycopg2.connect(\n",
    "    user = \"postgres\",\n",
    "    password = \"ucb\",\n",
    "    host = \"postgres\",\n",
    "    port = \"5432\",\n",
    "    database = \"postgres\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 289,
   "id": "dc7a762b",
   "metadata": {},
   "outputs": [],
   "source": [
    "cursor = connection.cursor()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 290,
   "id": "8d7ad400",
   "metadata": {},
   "outputs": [],
   "source": [
    "def my_read_csv_file(file_name, limit):\n",
    "    \"read the csv file and print only the first limit rows\"\n",
    "    \n",
    "    csv_file = open(file_name, \"r\")\n",
    "    \n",
    "    csv_data = csv.reader(csv_file)\n",
    "    \n",
    "    i = 0\n",
    "    \n",
    "    for row in csv_data:\n",
    "        i += 1\n",
    "        if i <= limit:\n",
    "            print(row)\n",
    "            \n",
    "    print(\"\\nPrinted \", min(limit, i), \"lines of \", i, \"total lines.\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 291,
   "id": "226cb7ed",
   "metadata": {},
   "outputs": [],
   "source": [
    "def my_calculate_box(point, miles):\n",
    "    \"Given a point and miles, calculate the box in form left, right, top, bottom\"\n",
    "    \n",
    "    geod = Geodesic.WGS84\n",
    "\n",
    "    kilometers = miles * 1.60934\n",
    "    meters = kilometers * 1000\n",
    "\n",
    "    g = geod.Direct(point[0], point[1], 270, meters)\n",
    "    left = (g['lat2'], g['lon2'])\n",
    "\n",
    "    g = geod.Direct(point[0], point[1], 90, meters)\n",
    "    right = (g['lat2'], g['lon2'])\n",
    "\n",
    "    g = geod.Direct(point[0], point[1], 0, meters)\n",
    "    top = (g['lat2'], g['lon2'])\n",
    "\n",
    "    g = geod.Direct(point[0], point[1], 180, meters)\n",
    "    bottom = (g['lat2'], g['lon2'])\n",
    "    \n",
    "    return(left, right, top, bottom)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 292,
   "id": "6a5cdcd5",
   "metadata": {},
   "outputs": [],
   "source": [
    "#\n",
    "#  Given two points in (latitude, longitude) format, calculate the distance between them in miles\n",
    "#\n",
    "\n",
    "def my_calculate_distance(point_1, point_2):\n",
    "    \"Given two points in (latitude, longitude) format, calculate the distance between them in miles\"\n",
    "    \n",
    "    geod = Geodesic.WGS84\n",
    "\n",
    "\n",
    "    g = geod.Inverse(point_1[0], point_1[1], point_2[0], point_2[1])\n",
    "    miles = g['s12'] / 1000 * 0.621371\n",
    "    \n",
    "    return miles"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "05d591f7",
   "metadata": {},
   "source": [
    "## Connect to Google Maps using your api key;  edit the file gmap_api_key.txt and put in your api key"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 293,
   "id": "a16d922b",
   "metadata": {},
   "outputs": [],
   "source": [
    "f = open('gmap_api_key.txt', 'r') # You need this file in the same folder that contains this notebook\n",
    "my_api_key = f.read()\n",
    "f.close()\n",
    "\n",
    "gmaps.configure(api_key=my_api_key)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 294,
   "id": "a5ad2a3f",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Getting Berkeley's store information and location\n",
    "\n",
    "rollback_before_flag = True\n",
    "rollback_after_flag = True\n",
    "\n",
    "query = \"\"\"\n",
    "\n",
    "SELECT * \n",
    "FROM stores\n",
    "WHERE city = 'Berkeley'\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "store = my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)\n",
    "store_coordinates = (store['latitude'][0], store['longitude'][0])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 295,
   "id": "46ed8656",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Function to get zip codes with a minimum quantity of customers\n",
    "# Within n miles from a station\n",
    "\n",
    "def my_station_get_zips(station, miles, min_customers = 0):\n",
    "    \"given a station, pull all zip codes with miles distance, print them, sum the population\"\n",
    "    \n",
    "    connection.rollback()\n",
    "    \n",
    "    query = \"select latitude, longitude from stations \"\n",
    "    query += \"where station = '\" + station + \"'\"\n",
    "    \n",
    "    cursor.execute(query)\n",
    "    \n",
    "    connection.rollback()\n",
    "    \n",
    "    rows = cursor.fetchall()\n",
    "    \n",
    "    for row in rows:\n",
    "        latitude = row[0]\n",
    "        longitude = row[1]\n",
    "        \n",
    "    point = (latitude, longitude)\n",
    "    distance_store = round(my_calculate_distance(store_coordinates, point),2)\n",
    "        \n",
    "    (left, right, top, bottom) = my_calculate_box(point, miles)\n",
    "    \n",
    "    \n",
    "    query = \"SELECT cu.zip, z.population, count(cu.customer_id)\"\n",
    "    query += \" FROM zip_codes AS z LEFT OUTER JOIN customers AS cu ON cu.zip = z.zip\"\n",
    "    query += \" where latitude >= \" + str(bottom[0])\n",
    "    query += \" and latitude <= \" + str(top [0])\n",
    "    query += \" and longitude >= \" + str(left[1])\n",
    "    query += \" and longitude <= \" + str(right[1])\n",
    "    query += \" GROUP BY cu.zip, z.population\"\n",
    "    query += \" HAVING count(cu.customer_id) >= \" + str(min_customers)\n",
    "    query += \" order by count(cu.customer_id) DESC \"\n",
    "\n",
    "    cursor.execute(query)\n",
    "    \n",
    "    connection.rollback()\n",
    "    \n",
    "    rows = cursor.fetchall()\n",
    "    \n",
    "    print(\"\\n-------------------------------------------------------------------------------\")\n",
    "    print(\"  Zip Codes within \" + str(miles) + \" mile(s) of \" + station + \" BART Station\")\n",
    "    print(\"-------------------------------------------------------------------------------\\n\")\n",
    "    \n",
    "    total_population = 0\n",
    "    total_customers = 0\n",
    "    \n",
    "    for row in rows:\n",
    "        zip = row[0]\n",
    "        population = row[1]\n",
    "        customers = row[2]\n",
    "        print(\"zip:\", zip, \"  population:\", f'{population:10,}', \"  customers:\", f'{customers:5,}')\n",
    "        total_population += population\n",
    "        total_customers += customers\n",
    "        \n",
    "    \n",
    "    print(\"\\n-------------------------------------------------------------------------------\")\n",
    "    print(\"  Total Population: \", f'{total_population:10,}')\n",
    "    print(\"  Total Customers: \", f'{total_customers:11,}')\n",
    "    print(\"  Distance from Store: \", f'{distance_store:7,}')\n",
    "    print(\"-------------------------------------------------------------------------------\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d2e6beed",
   "metadata": {},
   "source": [
    "# Dropping tables if they exist"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 296,
   "id": "3d30a2c7",
   "metadata": {},
   "outputs": [],
   "source": [
    "connection.rollback()\n",
    "\n",
    "query = \"\"\"\n",
    "\n",
    "DROP TABLE IF EXISTS stations;\n",
    "DROP TABLE IF EXISTS lines;\n",
    "DROP TABLE IF EXISTS travel_times;\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "cursor.execute(query)\n",
    "\n",
    "connection.commit()\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6c605bc0",
   "metadata": {},
   "source": [
    "# Creating tables"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 297,
   "id": "c23f9e13",
   "metadata": {},
   "outputs": [],
   "source": [
    "connection.rollback()\n",
    "\n",
    "query = \"\"\"\n",
    "\n",
    "CREATE TABLE stations (\n",
    "  station VARCHAR(32),\n",
    "  latitude NUMERIC(9,6),\n",
    "  longitude NUMERIC(9,6),\n",
    "  transfer_time NUMERIC(3),\n",
    "  PRIMARY KEY (station)\n",
    ");\n",
    "\n",
    "CREATE TABLE lines (\n",
    "  line VARCHAR(6),\n",
    "  sequence NUMERIC(2),\n",
    "  station VARCHAR(32),\n",
    "  PRIMARY KEY (line, sequence)\n",
    ");\n",
    "\n",
    "CREATE TABLE travel_times (\n",
    "  station_1 VARCHAR(32),\n",
    "  station_2 VARCHAR(32),\n",
    "  travel_time NUMERIC(3),\n",
    "  PRIMARY KEY (station_1, station_2)\n",
    ");\n",
    "\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "cursor.execute(query)\n",
    "\n",
    "connection.commit()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4e2aacba",
   "metadata": {},
   "source": [
    "# Loading database tables"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 298,
   "id": "d6f9cb1a",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Need to change this cell to the specific route where you have these files\n",
    "\n",
    "connection.rollback()\n",
    "\n",
    "query = \"\"\"\n",
    "\n",
    "COPY stations (station, latitude, longitude, transfer_time)\n",
    "FROM '/user/projects/project-3-Alteras1/exercise/stations.csv' delimiter ',' NULL '' csv header;\n",
    "\n",
    "COPY lines (line, sequence, station)\n",
    "FROM '/user/projects/project-3-Alteras1/exercise/lines.csv' delimiter ',' NULL '' csv header;\n",
    "\n",
    "COPY travel_times (station_1, station_2, travel_time)\n",
    "FROM '/user/projects/project-3-Alteras1/exercise/travel_times.csv' delimiter ',' NULL '' csv header;\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "cursor.execute(query)\n",
    "\n",
    "connection.commit()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ea24c550",
   "metadata": {},
   "source": [
    "## Getting zip codes for each customer"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 299,
   "id": "5724efcc",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>latitude</th>\n",
       "      <th>longitude</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>37.4949</td>\n",
       "      <td>-122.2080</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>37.4949</td>\n",
       "      <td>-122.2080</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>37.4949</td>\n",
       "      <td>-122.2080</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>37.4949</td>\n",
       "      <td>-122.2080</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>37.4949</td>\n",
       "      <td>-122.2080</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8133</th>\n",
       "      <td>38.1842</td>\n",
       "      <td>-122.2629</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8134</th>\n",
       "      <td>38.1842</td>\n",
       "      <td>-122.2629</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8135</th>\n",
       "      <td>38.1842</td>\n",
       "      <td>-122.2629</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8136</th>\n",
       "      <td>38.1842</td>\n",
       "      <td>-122.2629</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8137</th>\n",
       "      <td>38.1842</td>\n",
       "      <td>-122.2629</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>8138 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "      latitude  longitude\n",
       "0      37.4949  -122.2080\n",
       "1      37.4949  -122.2080\n",
       "2      37.4949  -122.2080\n",
       "3      37.4949  -122.2080\n",
       "4      37.4949  -122.2080\n",
       "...        ...        ...\n",
       "8133   38.1842  -122.2629\n",
       "8134   38.1842  -122.2629\n",
       "8135   38.1842  -122.2629\n",
       "8136   38.1842  -122.2629\n",
       "8137   38.1842  -122.2629\n",
       "\n",
       "[8138 rows x 2 columns]"
      ]
     },
     "execution_count": 299,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "rollback_before_flag = True\n",
    "rollback_after_flag = True\n",
    "\n",
    "query = \"\"\"\n",
    "\n",
    "SELECT z.latitude, z.longitude\n",
    "FROM customers AS cu\n",
    "     JOIN zip_codes AS z\n",
    "         ON cu.zip = z.zip\n",
    "         \n",
    "WHERE cu.closest_store_id = 1\n",
    "ORDER BY 1,2\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "zip_cust = my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)\n",
    "zip_cust"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5aab6401",
   "metadata": {},
   "source": [
    "## Getting station information"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 300,
   "id": "d38125eb",
   "metadata": {},
   "outputs": [],
   "source": [
    "rollback_before_flag = True\n",
    "rollback_after_flag = True\n",
    "\n",
    "query = \"\"\"\n",
    "\n",
    "SELECT * \n",
    "FROM stations\n",
    "ORDER BY station;\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "bart_stations = my_select_query_pandas(query, rollback_before_flag, rollback_after_flag)\n",
    "\n",
    "bart_markers = bart_stations[['latitude','longitude']]\n",
    "station_names = bart_stations[['station']]\n",
    "store_marker = store[['latitude','longitude']]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 301,
   "id": "201c7670",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of 12th Street BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "zip: 94612   population:     16,062   customers:   161\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:      16,062\n",
      "  Total Customers:          161\n",
      "  Distance from Store:     3.63\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of 16th Street Mission BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "zip: 94103   population:     28,735   customers:    77\n",
      "zip: 94114   population:     34,754   customers:    58\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:      63,489\n",
      "  Total Customers:          135\n",
      "  Distance from Store:    10.74\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of 19th Street BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "zip: 94612   population:     16,062   customers:   161\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:      16,062\n",
      "  Total Customers:          161\n",
      "  Distance from Store:     3.32\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of 24th Street Mission BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "zip: 94110   population:     74,161   customers:    75\n",
      "zip: 94114   population:     34,754   customers:    58\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:     108,915\n",
      "  Total Customers:          133\n",
      "  Distance from Store:    11.22\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of Antioch BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:           0\n",
      "  Total Customers:            0\n",
      "  Distance from Store:    27.81\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of Ashby BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "zip: 94702   population:     17,092   customers:   171\n",
      "zip: 94704   population:     29,190   customers:   161\n",
      "zip: 94703   population:     21,937   customers:   155\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:      68,219\n",
      "  Total Customers:          487\n",
      "  Distance from Store:     0.55\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of Balboa Park BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "zip: 94112   population:     85,166   customers:    40\n",
      "zip: 94127   population:     21,423   customers:    36\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:     106,589\n",
      "  Total Customers:           76\n",
      "  Distance from Store:    13.79\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of Bay Fair BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "zip: 94578   population:     41,059   customers:    63\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:      41,059\n",
      "  Total Customers:           63\n",
      "  Distance from Store:    13.16\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of Berryessa BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "zip: None   population:     28,726   customers:     0\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:      28,726\n",
      "  Total Customers:            0\n",
      "  Distance from Store:    39.71\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of Castro Valley BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:           0\n",
      "  Total Customers:            0\n",
      "  Distance from Store:    15.21\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of Civic Center BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "zip: 94102   population:     31,067   customers:    78\n",
      "zip: 94103   population:     28,735   customers:    77\n",
      "zip: 94108   population:     14,550   customers:    50\n",
      "zip: 94104   population:        546   customers:     5\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:      74,898\n",
      "  Total Customers:          210\n",
      "  Distance from Store:     9.87\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of Coliseum BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:           0\n",
      "  Total Customers:            0\n",
      "  Distance from Store:     7.84\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of Colma BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "zip: 94015   population:     64,887   customers:     4\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:      64,887\n",
      "  Total Customers:            4\n",
      "  Distance from Store:     16.3\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of Concord BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:           0\n",
      "  Total Customers:            0\n",
      "  Distance from Store:    15.04\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of Daly City BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:           0\n",
      "  Total Customers:            0\n",
      "  Distance from Store:    15.37\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of Downtown Berkeley BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "zip: 94702   population:     17,092   customers:   171\n",
      "zip: 94704   population:     29,190   customers:   161\n",
      "zip: 94703   population:     21,937   customers:   155\n",
      "zip: 94709   population:     11,740   customers:   117\n",
      "zip: 94720   population:      2,971   customers:    30\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:      82,930\n",
      "  Total Customers:          634\n",
      "  Distance from Store:     1.07\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of Dublin BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "zip: 94568   population:     54,420   customers:    10\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:      54,420\n",
      "  Total Customers:           10\n",
      "  Distance from Store:    22.44\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of El Cerrito del Norte BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:           0\n",
      "  Total Customers:            0\n",
      "  Distance from Store:     5.71\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of El Cerrito Plaza BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "zip: 94706   population:     21,040   customers:   175\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:      21,040\n",
      "  Total Customers:          175\n",
      "  Distance from Store:     3.88\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of Embarcadero BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "zip: 94133   population:     26,527   customers:    57\n",
      "zip: 94108   population:     14,550   customers:    50\n",
      "zip: 94105   population:      9,155   customers:    48\n",
      "zip: 94111   population:      3,620   customers:    36\n",
      "zip: 94104   population:        546   customers:     5\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:      54,398\n",
      "  Total Customers:          196\n",
      "  Distance from Store:     8.64\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of Fremont BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "zip: 94536   population:     73,855   customers:     8\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:      73,855\n",
      "  Total Customers:            8\n",
      "  Distance from Store:    25.77\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of Fruitvale BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "zip: 94601   population:     52,299   customers:   180\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:      52,299\n",
      "  Total Customers:          180\n",
      "  Distance from Store:     5.91\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of Glen Park BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "zip: 94131   population:     29,902   customers:    63\n",
      "zip: 94112   population:     85,166   customers:    40\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:     115,068\n",
      "  Total Customers:          103\n",
      "  Distance from Store:     12.7\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of Hayward BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "zip: 94541   population:     66,056   customers:    10\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:      66,056\n",
      "  Total Customers:           10\n",
      "  Distance from Store:    15.95\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of Lafayette BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "zip: 94549   population:     29,639   customers:   129\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:      29,639\n",
      "  Total Customers:          129\n",
      "  Distance from Store:     7.87\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of Lake Merritt BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "zip: 94612   population:     16,062   customers:   161\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:      16,062\n",
      "  Total Customers:          161\n",
      "  Distance from Store:      4.0\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of MacArthur BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "zip: 94609   population:     22,811   customers:   155\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:      22,811\n",
      "  Total Customers:          155\n",
      "  Distance from Store:     1.92\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of Millbrae BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "zip: 94030   population:     22,710   customers:    10\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:      22,710\n",
      "  Total Customers:           10\n",
      "  Distance from Store:    18.91\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of Milpitas BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:           0\n",
      "  Total Customers:            0\n",
      "  Distance from Store:    36.78\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of Montgomery Street BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "zip: 94102   population:     31,067   customers:    78\n",
      "zip: 94133   population:     26,527   customers:    57\n",
      "zip: 94108   population:     14,550   customers:    50\n",
      "zip: 94105   population:      9,155   customers:    48\n",
      "zip: 94111   population:      3,620   customers:    36\n",
      "zip: 94104   population:        546   customers:     5\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:      85,465\n",
      "  Total Customers:          274\n",
      "  Distance from Store:     8.99\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of North Berkeley BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "zip: 94702   population:     17,092   customers:   171\n",
      "zip: 94703   population:     21,937   customers:   155\n",
      "zip: 94709   population:     11,740   customers:   117\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:      50,769\n",
      "  Total Customers:          443\n",
      "  Distance from Store:     1.76\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of North Concord BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "zip: 94520   population:     38,568   customers:    35\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:      38,568\n",
      "  Total Customers:           35\n",
      "  Distance from Store:    16.43\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of OAK BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:           0\n",
      "  Total Customers:            0\n",
      "  Distance from Store:    10.16\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of Orinda BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "zip: 94563   population:     19,341   customers:   193\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:      19,341\n",
      "  Total Customers:          193\n",
      "  Distance from Store:     4.48\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of Pittsburg BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:           0\n",
      "  Total Customers:            0\n",
      "  Distance from Store:    20.62\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of Pittsburg Center BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "zip: 94565   population:     96,081   customers:     1\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:      96,081\n",
      "  Total Customers:            1\n",
      "  Distance from Store:    23.13\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of Pleasant Hill BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "zip: 94597   population:     22,734   customers:    74\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:      22,734\n",
      "  Total Customers:           74\n",
      "  Distance from Store:    12.25\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of Powell Street BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "zip: 94102   population:     31,067   customers:    78\n",
      "zip: 94103   population:     28,735   customers:    77\n",
      "zip: 94109   population:     56,677   customers:    75\n",
      "zip: 94108   population:     14,550   customers:    50\n",
      "zip: 94105   population:      9,155   customers:    48\n",
      "zip: 94104   population:        546   customers:     5\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:     140,730\n",
      "  Total Customers:          333\n",
      "  Distance from Store:     9.46\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of Richmond BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:           0\n",
      "  Total Customers:            0\n",
      "  Distance from Store:     7.56\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of Rockridge BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "zip: 94618   population:     17,041   customers:   156\n",
      "zip: 94609   population:     22,811   customers:   155\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:      39,852\n",
      "  Total Customers:          311\n",
      "  Distance from Store:     0.89\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of San Bruno BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "zip: 94066   population:     43,124   customers:     9\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:      43,124\n",
      "  Total Customers:            9\n",
      "  Distance from Store:    17.25\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of San Leandro BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "zip: 94577   population:     48,088   customers:    72\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:      48,088\n",
      "  Total Customers:           72\n",
      "  Distance from Store:    10.72\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of SFO BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "zip: 94128   population:        135   customers:     1\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:         135\n",
      "  Total Customers:            1\n",
      "  Distance from Store:    17.97\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of South Hayward BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "zip: 94544   population:     79,235   customers:     9\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:      79,235\n",
      "  Total Customers:            9\n",
      "  Distance from Store:    18.88\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of South San Francisco BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:           0\n",
      "  Total Customers:            0\n",
      "  Distance from Store:    16.58\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of Union City BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "zip: 94587   population:     74,601   customers:     9\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:      74,601\n",
      "  Total Customers:            9\n",
      "  Distance from Store:     22.6\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of Walnut Creek BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "zip: 94597   population:     22,734   customers:    74\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:      22,734\n",
      "  Total Customers:           74\n",
      "  Distance from Store:    11.11\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of Warm Springs BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:           0\n",
      "  Total Customers:            0\n",
      "  Distance from Store:    29.99\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of West Dublin BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:           0\n",
      "  Total Customers:            0\n",
      "  Distance from Store:    21.12\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Zip Codes within 1 mile(s) of West Oakland BART Station\n",
      "-------------------------------------------------------------------------------\n",
      "\n",
      "zip: 94607   population:     26,254   customers:   203\n",
      "\n",
      "-------------------------------------------------------------------------------\n",
      "  Total Population:      26,254\n",
      "  Total Customers:          203\n",
      "  Distance from Store:     3.97\n",
      "-------------------------------------------------------------------------------\n"
     ]
    }
   ],
   "source": [
    "# Getting station and zip codes\n",
    "\n",
    "for station in station_names['station']:\n",
    "    my_station_get_zips(station, 1)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d7f29521",
   "metadata": {},
   "source": [
    "# Visualizations"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 302,
   "id": "bfa8e0f9",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "543d873c5e324407865fb89942c189d3",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Figure(layout=FigureLayout(height='420px'))"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "f = open('geojson_data/customer_zip_geojson.json')\n",
    "customer_zip_geojson = json.load(f)\n",
    "f.close()\n",
    "\n",
    "fig = gmaps.figure(center=store_coordinates, map_type = 'HYBRID', zoom_level=10)\n",
    "\n",
    "# Adding geometries for zip codes\n",
    "geojson_layer = gmaps.geojson_layer(customer_zip_geojson, fill_color = 'white', fill_opacity = 0, \n",
    "                                    stroke_color = 'white', stroke_weight = 1, stroke_opacity = 0.7)\n",
    "fig.add_layer(geojson_layer)\n",
    "\n",
    "# Adding point markers for stations\n",
    "station_marker_layer = gmaps.symbol_layer(bart_markers, hover_text = station_names['station'],\n",
    "                                          fill_color = 'white', fill_opacity = 1, \n",
    "                                          stroke_color = 'blue', stroke_opacity = 1)\n",
    "fig.add_layer(station_marker_layer)\n",
    "\n",
    "# Adding customer heatmap by zipcode\n",
    "heatmap_layer = gmaps.heatmap_layer(zip_cust)\n",
    "heatmap_layer.point_radius = 25\n",
    "fig.add_layer(heatmap_layer)\n",
    "\n",
    "# Adding marker for the store location\n",
    "fig.add_layer(gmaps.marker_layer(store_marker, info_box_content =[\"Berkeley ACME Store\"]))\n",
    "\n",
    "# Adding transit layer\n",
    "fig.add_layer(gmaps.transit_layer())\n",
    "\n",
    "fig"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 303,
   "id": "3de0eb14",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "0799f25fd1f54087bcafc1cc5c10f136",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Figure(layout=FigureLayout(height='420px'))"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "f = open('geojson_data/customer_zip_geojson.json')\n",
    "customer_zip_geojson = json.load(f)\n",
    "f.close()\n",
    "\n",
    "fig = gmaps.figure(center=store_coordinates, zoom_level=10)\n",
    "\n",
    "# Adding geometries for zip codes\n",
    "geojson_layer = gmaps.geojson_layer(customer_zip_geojson, fill_color = 'white', fill_opacity = 0, \n",
    "                                    stroke_color = 'gray', stroke_weight = 1, stroke_opacity = 0.7)\n",
    "fig.add_layer(geojson_layer)\n",
    "\n",
    "# Adding point markers for stations\n",
    "station_marker_layer = gmaps.symbol_layer(bart_markers, hover_text = station_names['station'],\n",
    "                                          fill_color = 'white', fill_opacity = 1, \n",
    "                                          stroke_color = 'blue', stroke_opacity = 1)\n",
    "fig.add_layer(station_marker_layer)\n",
    "\n",
    "# Adding customer heatmap by zipcode\n",
    "heatmap_layer = gmaps.heatmap_layer(zip_cust)\n",
    "heatmap_layer.point_radius = 25\n",
    "fig.add_layer(heatmap_layer)\n",
    "\n",
    "# Adding marker for the store location\n",
    "fig.add_layer(gmaps.marker_layer(store_marker, info_box_content =[\"Berkeley ACME Store\"]))\n",
    "\n",
    "# Adding transit layer\n",
    "fig.add_layer(gmaps.transit_layer())\n",
    "\n",
    "fig"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2b1fadcc",
   "metadata": {},
   "source": [
    "# Neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 304,
   "id": "c907d948",
   "metadata": {},
   "outputs": [],
   "source": [
    "import neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 305,
   "id": "74fb576f",
   "metadata": {},
   "outputs": [],
   "source": [
    "driver = neo4j.GraphDatabase.driver(uri=\"neo4j://neo4j:7687\", auth=(\"neo4j\",\"w205\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 306,
   "id": "9bc1f5e3",
   "metadata": {},
   "outputs": [],
   "source": [
    "session = driver.session(database=\"neo4j\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 307,
   "id": "a463814c",
   "metadata": {},
   "outputs": [],
   "source": [
    "def my_neo4j_wipe_out_database():\n",
    "    \"wipe out database by deleting all nodes and relationships\"\n",
    "    \n",
    "    query = \"match (node)-[relationship]->() delete node, relationship\"\n",
    "    session.run(query)\n",
    "    \n",
    "    query = \"match (node) delete node\"\n",
    "    session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 308,
   "id": "41f6262a",
   "metadata": {},
   "outputs": [],
   "source": [
    "def my_neo4j_run_query_pandas(query, **kwargs):\n",
    "    \"run a query and return the results in a pandas dataframe\"\n",
    "    \n",
    "    result = session.run(query, **kwargs)\n",
    "    \n",
    "    df = pd.DataFrame([r.values() for r in result], columns=result.keys())\n",
    "    \n",
    "    return df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 309,
   "id": "c7d363d7",
   "metadata": {
    "jupyter": {
     "source_hidden": true
    },
    "tags": []
   },
   "outputs": [],
   "source": [
    "def neo4j_number_nodes_relationships():\n",
    "    \"print the number of nodes and relationships\"\n",
    "   \n",
    "    \n",
    "    query = \"\"\"\n",
    "        match (n) \n",
    "        return n.name as node_name, labels(n) as labels\n",
    "        order by n.name\n",
    "    \"\"\"\n",
    "    \n",
    "    df = my_neo4j_run_query_pandas(query)\n",
    "    \n",
    "    number_nodes = df.shape[0]\n",
    "    \n",
    "    \n",
    "    query = \"\"\"\n",
    "        match (n1)-[r]->(n2) \n",
    "        return n1.name as node_name_1, labels(n1) as node_1_labels, \n",
    "            type(r) as relationship_type, n2.name as node_name_2, labels(n2) as node_2_labels\n",
    "        order by node_name_1, node_name_2\n",
    "    \"\"\"\n",
    "    \n",
    "    df = my_neo4j_run_query_pandas(query)\n",
    "    \n",
    "    number_relationships = df.shape[0]\n",
    "    \n",
    "    print(\"-------------------------\")\n",
    "    print(\"  Nodes:\", number_nodes)\n",
    "    print(\"  Relationships:\", number_relationships)\n",
    "    print(\"-------------------------\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 310,
   "id": "410eac9b",
   "metadata": {},
   "outputs": [],
   "source": [
    "def create_station_node_with_coords(station_name, latitude, longitude):\n",
    "    \"create a node with label Station\"\n",
    "    \n",
    "    query = \"\"\"\n",
    "    \n",
    "    CREATE (:Station {name: $station_name,\n",
    "                    location:point({latitude: $latitude, longitude: $longitude}),\n",
    "                    line: []})\n",
    "    \n",
    "    \"\"\"\n",
    "    \n",
    "    session.run(query, station_name=station_name, latitude=latitude, longitude=longitude)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 311,
   "id": "7bd98624",
   "metadata": {},
   "outputs": [],
   "source": [
    "def create_station_relationship_one_way(from_station, to_station, weight):\n",
    "    \"create a relationship one way between two stations with a weight\"\n",
    "    \n",
    "    query = \"\"\"\n",
    "    \n",
    "    MATCH (from:Station), \n",
    "          (to:Station)\n",
    "    WHERE from.name = $from_station and to.name = $to_station\n",
    "    CREATE (from)-[:LINK {weight: $weight}]->(to)\n",
    "    \n",
    "    \"\"\"\n",
    "    \n",
    "    session.run(query, from_station=from_station, to_station=to_station, weight=weight)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 312,
   "id": "a02cb895",
   "metadata": {},
   "outputs": [],
   "source": [
    "def create_station_relationship_two_way(from_station, to_station, weight, line):\n",
    "    \"create relationships two way between two stations with a weight\"\n",
    "    \n",
    "    query = \"\"\"\n",
    "    \n",
    "    MATCH (from:Station), \n",
    "          (to:Station)\n",
    "    WHERE from.name = $from_station and to.name = $to_station\n",
    "    CREATE (from)-[:LINK {weight: $weight, line: $line}]->(to),\n",
    "           (to)-[:LINK {weight: $weight, line: $line}]->(from)\n",
    "    \n",
    "    \"\"\"\n",
    "    \n",
    "    session.run(query, from_station=from_station, to_station=to_station, weight=weight, line=line)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 313,
   "id": "1581f3cf",
   "metadata": {},
   "outputs": [],
   "source": [
    "my_neo4j_wipe_out_database()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 314,
   "id": "42f9e670",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-------------------------\n",
      "  Nodes: 50\n",
      "  Relationships: 0\n",
      "-------------------------\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "\n",
    "select * from stations order by station\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "stations = my_select_query_pandas(query, True, True)\n",
    "\n",
    "stations.apply(lambda s: create_station_node_with_coords(s['station'], s['latitude'], s['longitude']), axis=1)\n",
    "\n",
    "neo4j_number_nodes_relationships()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 315,
   "id": "d91b00aa",
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_line_to_station(station, line):\n",
    "    \"adds a line to the line label for the station\"\n",
    "    \n",
    "    query = \"\"\"\n",
    "    \n",
    "    MATCH (s:Station)\n",
    "    WHERE s.name = $station\n",
    "    SET s.line = coalesce(s.line, []) + $line\n",
    "    \n",
    "    \"\"\"\n",
    "    \n",
    "    session.run(query, station=station, line=line)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 316,
   "id": "44eb0fa0",
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "\n",
    "select * from lines order by station\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "stations = my_select_query_pandas(query, True, True)\n",
    "\n",
    "for station in stations.groupby('station')['line'].unique().to_dict().items():\n",
    "    name = station[0]\n",
    "    lines = station[1].tolist()\n",
    "    \n",
    "    add_line_to_station(name, lines)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 317,
   "id": "7d9d0ce1",
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "\n",
    "SELECT \n",
    "    a.line,\n",
    "    a.station as from_station,\n",
    "    b.station as to_station,\n",
    "    t.travel_time::integer\n",
    "FROM\n",
    "    lines a\n",
    "    JOIN lines b\n",
    "        ON a.line = b.line AND b.sequence = (a.sequence + 1)\n",
    "    JOIN travel_times t\n",
    "        ON (a.station = t.station_2 AND b.station = t.station_1)\n",
    "            OR (a.station = t.station_1 AND b.station=t.station_2)\n",
    "ORDER BY\n",
    "    line,\n",
    "    from_station,\n",
    "    to_station\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "lines_travel_times = my_select_query_pandas(query, True, True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 318,
   "id": "fd14bd43",
   "metadata": {},
   "outputs": [],
   "source": [
    "lines_travel_times\n",
    "\n",
    "for index, row in lines_travel_times.iterrows():\n",
    "    line = row[0]\n",
    "    station_a = row[1]\n",
    "    station_b = row[2]\n",
    "    time = row[3]\n",
    "    create_station_relationship_two_way(station_a, station_b, time, line)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 319,
   "id": "769ec8a5",
   "metadata": {},
   "outputs": [],
   "source": [
    "def create_zipcode_node(zipcode, latitude, longitude, count):\n",
    "    \"create a node with label Station\"\n",
    "    \n",
    "    query = \"\"\"\n",
    "    \n",
    "    CREATE (:Zip_Code {name: $zipcode,\n",
    "                    location:point({latitude: $latitude, longitude: $longitude}),\n",
    "                    count: $count})\n",
    "    \n",
    "    \"\"\"\n",
    "    \n",
    "    session.run(query, zipcode=zipcode, latitude=latitude, longitude=longitude, count=count)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 320,
   "id": "a749ac55",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0      None\n",
       "1      None\n",
       "2      None\n",
       "3      None\n",
       "4      None\n",
       "       ... \n",
       "139    None\n",
       "140    None\n",
       "141    None\n",
       "142    None\n",
       "143    None\n",
       "Length: 144, dtype: object"
      ]
     },
     "execution_count": 320,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "\n",
    "SELECT z.zip,\n",
    "        z.latitude,\n",
    "        z.longitude,\n",
    "        count(cu.customer_id) \n",
    "FROM customers AS cu\n",
    "     JOIN zip_codes AS z\n",
    "         ON cu.zip = z.zip\n",
    "         \n",
    "WHERE cu.closest_store_id = 1\n",
    "GROUP BY z.zip\n",
    "ORDER BY count DESC\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "zipcodes_customers = my_select_query_pandas(query, True, True)\n",
    "zipcodes_customers.apply(lambda z: create_zipcode_node('ZC ' + z['zip'], z['latitude'], z['longitude'], z['count']), axis=1)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 321,
   "id": "740ec4c9-0ccb-4ed6-b26b-c4430c4d3533",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>zip.name</th>\n",
       "      <th>station.name</th>\n",
       "      <th>distance_km</th>\n",
       "      <th>distance_inv</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>ZC 94608</td>\n",
       "      <td>12th Street</td>\n",
       "      <td>3.826299</td>\n",
       "      <td>0.261349</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ZC 94607</td>\n",
       "      <td>12th Street</td>\n",
       "      <td>2.513580</td>\n",
       "      <td>0.397839</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ZC 94606</td>\n",
       "      <td>12th Street</td>\n",
       "      <td>2.714935</td>\n",
       "      <td>0.368333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ZC 94501</td>\n",
       "      <td>12th Street</td>\n",
       "      <td>3.171903</td>\n",
       "      <td>0.315268</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ZC 94610</td>\n",
       "      <td>12th Street</td>\n",
       "      <td>2.752890</td>\n",
       "      <td>0.363255</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>304</th>\n",
       "      <td>ZC 94606</td>\n",
       "      <td>West Oakland</td>\n",
       "      <td>4.641894</td>\n",
       "      <td>0.215429</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>305</th>\n",
       "      <td>ZC 94501</td>\n",
       "      <td>West Oakland</td>\n",
       "      <td>3.757666</td>\n",
       "      <td>0.266123</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>306</th>\n",
       "      <td>ZC 94610</td>\n",
       "      <td>West Oakland</td>\n",
       "      <td>4.699794</td>\n",
       "      <td>0.212775</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>307</th>\n",
       "      <td>ZC 94612</td>\n",
       "      <td>West Oakland</td>\n",
       "      <td>2.327587</td>\n",
       "      <td>0.429629</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>308</th>\n",
       "      <td>ZC 94609</td>\n",
       "      <td>West Oakland</td>\n",
       "      <td>4.248156</td>\n",
       "      <td>0.235396</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>309 rows × 4 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "     zip.name  station.name  distance_km  distance_inv\n",
       "0    ZC 94608   12th Street     3.826299      0.261349\n",
       "1    ZC 94607   12th Street     2.513580      0.397839\n",
       "2    ZC 94606   12th Street     2.714935      0.368333\n",
       "3    ZC 94501   12th Street     3.171903      0.315268\n",
       "4    ZC 94610   12th Street     2.752890      0.363255\n",
       "..        ...           ...          ...           ...\n",
       "304  ZC 94606  West Oakland     4.641894      0.215429\n",
       "305  ZC 94501  West Oakland     3.757666      0.266123\n",
       "306  ZC 94610  West Oakland     4.699794      0.212775\n",
       "307  ZC 94612  West Oakland     2.327587      0.429629\n",
       "308  ZC 94609  West Oakland     4.248156      0.235396\n",
       "\n",
       "[309 rows x 4 columns]"
      ]
     },
     "execution_count": 321,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "\n",
    "MATCH (zip:Zip_Code)\n",
    "MATCH (station:Station) WHERE point.distance(zip.location,station.location) < 4830\n",
    "RETURN zip.name, station.name, point.distance(zip.location, station.location)/1000 AS distance_km, 1000/point.distance(zip.location, station.location) AS distance_inv\n",
    "ORDER BY station.name\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "my_neo4j_run_query_pandas(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 322,
   "id": "3e933c73-9000-4881-af3c-9f0f910697f5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j.work.result.Result at 0x7f9d916b2040>"
      ]
     },
     "execution_count": 322,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# connect zipcodes to all stations within 3 miles (~4830 meters)\n",
    "\n",
    "query = \"\"\"\n",
    "\n",
    "MATCH (zip:Zip_Code)\n",
    "MATCH (station:Station) WHERE point.distance(zip.location,station.location) < 4830\n",
    "CREATE (zip)-[:Close_To {distance_km:point.distance(zip.location, station.location)/1000,\n",
    "                        distance_inv:100000/point.distance(zip.location, station.location)\n",
    "                        }]->(station)\n",
    "CREATE (station)-[:Close_To {distance_km:point.distance(zip.location, station.location)/1000,\n",
    "                        distance_inv:100000/point.distance(zip.location, station.location)\n",
    "                        }]->(zip)\n",
    "\n",
    "\"\"\"\n",
    "session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 323,
   "id": "430f15fa-d114-4324-926d-d37bd55869fe",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j.work.result.Result at 0x7f9d916b3dc0>"
      ]
     },
     "execution_count": 323,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# connect all stations by closeness\n",
    "\n",
    "query = \"\"\"\n",
    "\n",
    "MATCH (s:Station)\n",
    "CALL {\n",
    "    WITH s\n",
    "    MATCH (s)-[:LINK]->(so:Station)\n",
    "    RETURN collect(distinct so) AS other_stations\n",
    "}\n",
    "UNWIND other_stations as o\n",
    "CREATE (s)-[:Close_To {distance_km: point.distance(s.location, o.location), distance_inv: 100000/point.distance(s.location, o.location)}]->(o)\n",
    "\n",
    "\"\"\"\n",
    "session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 324,
   "id": "5b25fb5b-8153-4790-afb9-7e743516de0b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j.work.result.Result at 0x7f9d916b3940>"
      ]
     },
     "execution_count": 324,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# label all connections for easier graph projection\n",
    "\n",
    "query = \"MATCH (n)--(m) SET n:Connected\"\n",
    "session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 325,
   "id": "52cbf673-1fcf-4e97-9b63-56150846c5f9",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j.work.result.Result at 0x7f9d8e8678e0>"
      ]
     },
     "execution_count": 325,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"CALL gds.graph.drop('distance_graph', false)\"\"\"\n",
    "\n",
    "session.run(query)\n",
    "\n",
    "query = \"\"\"\n",
    "\n",
    "CALL gds.graph.project(\n",
    "    'distance_graph',\n",
    "    'Connected',\n",
    "    {Close_To: {orientation: 'UNDIRECTED'}},\n",
    "    {relationshipProperties: 'distance_inv'}\n",
    ")\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "session.run(query)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 326,
   "id": "a6d8e5a3-a893-45d3-9449-eeddb934902d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>modularity</th>\n",
       "      <th>modularities</th>\n",
       "      <th>ranLevels</th>\n",
       "      <th>communityCount</th>\n",
       "      <th>communityDistribution</th>\n",
       "      <th>postProcessingMillis</th>\n",
       "      <th>preProcessingMillis</th>\n",
       "      <th>computeMillis</th>\n",
       "      <th>configuration</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.766764</td>\n",
       "      <td>[0.6953195721364109, 0.76676375943006]</td>\n",
       "      <td>2</td>\n",
       "      <td>9</td>\n",
       "      <td>{'p99': 27, 'min': 2, 'max': 27, 'mean': 15.0,...</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>96</td>\n",
       "      <td>{'maxIterations': 10, 'seedProperty': None, 'c...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   modularity                            modularities  ranLevels  \\\n",
       "0    0.766764  [0.6953195721364109, 0.76676375943006]          2   \n",
       "\n",
       "   communityCount                              communityDistribution  \\\n",
       "0               9  {'p99': 27, 'min': 2, 'max': 27, 'mean': 15.0,...   \n",
       "\n",
       "   postProcessingMillis  preProcessingMillis  computeMillis  \\\n",
       "0                     2                    0             96   \n",
       "\n",
       "                                       configuration  \n",
       "0  {'maxIterations': 10, 'seedProperty': None, 'c...  "
      ]
     },
     "execution_count": 326,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"CALL gds.louvain.stats('distance_graph', {relationshipWeightProperty: 'distance_inv'})\"\"\"\n",
    "my_neo4j_run_query_pandas(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d7379514-ba88-4013-8710-d0b256b01f58",
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"CALL gds.louvain.write('distance_graph', {relationshipWeightProperty: 'distance_inv', writeProperty: 'communityId'})\"\"\"\n",
    "session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "699b51af",
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "\n",
    "MATCH (z:Zip_Code:Connected)\n",
    "WITH z.communityId AS comId,\n",
    "collect(distinct z.communityId) as communityIds\n",
    "UNWIND communityIds as com\n",
    "MATCH (s:Station:Connected) WHERE s.communityId = com\n",
    "WITH s.communityId as sCom, com as com,\n",
    "collect(s.name) AS stations\n",
    "MATCH (p:Zip_Code:Connected) WHERE p.communityId = com\n",
    "WITH p.communityId as pCom, stations as stations,\n",
    "collect(p.name) AS zipcodes, sum(p.count) AS customers\n",
    "RETURN pCom, stations, zipcodes, customers\n",
    "\n",
    "\"\"\"\n",
    "my_neo4j_run_query_pandas(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "20c6bebd",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "b7841aae",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "0d13926a",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
